// Create a copy of this file as 'variables.json'

{
  "postmark": {

    // The from address to use to send the email through Postmark
    // Important: Make sure that the Sender Signature has been setup or the 
    //            domain authenticated
    "from": "jane@example.com", 

    // The email address to send your tests to for looking at things manually
    // Note: You don't need to change this for Litmus. The Litmus testing has
    //       its own dedicated email variable below
    "to": "jon@example.com",    

    // Subject for test emails (this can help make it easier to find them)
    "subject": "Test Email"
  },
  "strings": {

    // The name you want to appear in email clients ()
    "sender_name": "[Jane from Acme]",

    // Your product's common name for use throughout the emails
    "product_name": "[Acme]",     

    // Your product's home page for the logo to link to
    "product_url": "https://example.com", 

    // The name of your company as it will appear on credit card statements
    "credit_card_statement_name": "[Acme Affiliate Corporation, LLC]",

    // The name of your company as it would appear in the footer of your emails
    "formal_company_name": "[Acme, LLC]",              

    // For your company's address (optional)
    "address_line_1": "1234 Street Rd.",
    "address_line_2": "Suite 1234",
    "city": "Cityville",
    "state": "ST",
    "country": "United States",

    // Your company's phone number (optional)
    "phone": "123-456-7890",

    // This is your Litmus test addres for your team to email tests to Litmus
    "litmus_email": "something@litmus.com"
  },
  "images": {

    // True if you want to use images, false if you don't.
    // If you disallow images, the masthead will just use the product name
    // in large bold text
    "use_images'": false,

    // If you use images in you remails, you'll need to host the images
    // somewhere. Adding image hosting to Postmark templates is on the roadmap,
    // but it's not ready yet. So this is the fully qualified URL where the 
    // emails can find the images
    "images_url": "https://example.com/example/images/",

    // The file name for the logo you'd like to display in the header
    "logo_file": "logo.png",

    // The width of the logo in the header
    "logo_width": "186",

    // By default, the social media icons will display the standard logos, but
    // you can set this to true to use circle versions with the logos cut out.
    // Generally, circles look best if you have a lot of social links, but 
    // standard logos look better if you only have a few. Try both and see 
    // which one you like best. :)
    "use_social_circles": false,

    // The URLs for the relevant social profiles. If you don't have one or don't
    // want to include it, just leave it blank.
    "twitter_url": "",
    "facebook_url": "",
    "pinterest_url": "",
    "instagram_url": "",
    "google_plus_url": "",
    "youtube_url": "",
    "linkedin_url": "",
    "dribbble_url": ""
  },

  // If you want to use images in your emails, you'll need to host them on your
  // own server. There's a grunt task to automatically upload your images to 
  // your asset server via FTP. You would just need to provide your connection
  // information here.
  "ftp": {

    // Make sure to set this to your IP or domain for your image asset server
    "host": "12.34.56.79",

    // You're most likely using port 21 for FTP
    "port": "21",

    // The local directory from which you want to copy files
    "src": "src/images",        

    // The target directory where the files should be uplaoded on your asset
    // server
    "dest": "/example/images"   
  }  
}